# SetColumnWidths Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillLegend..::..SetColumnWidths Method
ColorFillLegend Class See Also
---
Sets array of column widths.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetColumnWidths(
	IList<double> widths
)
```

Visual Basic
---
```text
Public Sub SetColumnWidths ( _
	widths As IList(Of Double) _
)
```

Visual C++
---
```text
public:
void SetColumnWidths(
	IList<double>^ widths
)
```

# ### Parameters
widths
    Type: System.Collections.Generic..::..IList<(Of <(<'Double>)>)>
# Remarks
Input array length must be the same as what GetColumnWidths()()()() returns. It can only contain positive values.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Array is not valid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace